#+TITLE: Rest In Practice with Dropwizard and Gradle
#+AUTHOR: José Miguel
#+EMAIL: jm@0pt1mates.com
#+EXPORT_EXCLUDE_TAGS: noexport

* Introduction

I read the book and use it to practice craftmanship.

* Requirements

- Java
- Gradle

* Usage

Build java binary and run it:

#+BEGIN_SRC bash
$ gradle shadowJar
$ java -jar build/libs/rest-in-practice-1.0-all.jar server src/main/rip.yaml
#+END_SRC

And navigate to [[http://localhost:8080/order][GET order endpoint]].

* Development
** Unit testing

#+BEGIN_SRC bash
$ gradle test -Dtest.single="OrderResourceTest"
#+END_SRC

* Documentation

Navigate to [[http://localhost:8080/swagger][/swagger]] to see available endpoints.

#+BEGIN_SRC javascript
{
  "items": [
    {
      "size": "small",
      "quantity": 1,
      "name": "flat white"
    }
  ],
  "location": "location"
}
#+END_SRC
* Time report                                                      :noexport:

#+BEGIN: clocktable :maxlevel 2 :scope subtree
Clock summary at [2014-09-25 Thu 23:49]

| Headline                                     | Time   |      |
|----------------------------------------------+--------+------|
| *Total time*                                 | *5:00* |      |
|----------------------------------------------+--------+------|
| Time report                                  | 5:00   |      |
| \__ Project setup                            |        | 0:29 |
| \__ Dropwizard bootstrapping                 |        | 0:27 |
| \__ Resource and healthcheck registration... |        | 0:28 |
| \__ DONE Order representation                |        | 2:18 |
| \__ Order service                            |        | 0:14 |
| \__ DONE Swagger                             |        | 0:32 |
| \__ DONE Submit order                        |        | 0:32 |
#+END:

** Project setup
   CLOCK: [2014-09-01 Mon 22:09]--[2014-09-01 Mon 22:38] =>  0:29
** Dropwizard bootstrapping
   CLOCK: [2014-09-01 Mon 23:24]--[2014-09-01 Mon 23:51] =>  0:27
** Resource and healthcheck registration testing
   CLOCK: [2014-09-01 Mon 23:52]--[2014-09-02 Tue 00:20] =>  0:28
** DONE Order representation
   CLOSED: [2014-09-25 Thu 23:49]
   CLOCK: [2014-09-25 Thu 23:08]--[2014-09-25 Thu 23:49] =>  0:41
   CLOCK: [2014-09-06 Sat 18:01]--[2014-09-06 Sat 19:35] =>  1:34
   CLOCK: [2014-09-02 Tue 00:21]--[2014-09-02 Tue 00:24] =>  0:03
** Order service
   CLOCK: [2014-09-06 Sat 19:35]--[2014-09-06 Sat 19:49] =>  0:14
** DONE Swagger
   CLOSED: [2014-09-21 Sun 21:59]
   CLOCK: [2014-09-21 Sun 21:27]--[2014-09-21 Sun 21:59] =>  0:32
** DONE Submit order
   CLOSED: [2014-09-25 Thu 23:06]
   CLOCK: [2014-09-25 Thu 22:34]--[2014-09-25 Thu 23:06] =>  0:32
